#2.9 数値についてもっと詳しく
#2.9.1 10進数以外の整数リテラル

#2進数
0b11111111#=>255
#8進数
0337 #=>255
#16進数
0xff #=>255

#2.9.2 ビット演算
(~0b1010).to_s(2) #=>"-1011"
(0b1010 & 0b1100).to_s(2) #=>"1000"
(0b1010 | 0b1100).to_s(2) #=>"1110"
(0b1010^0b1100).to_s(2) #=>"110"
(0b1010>>1).to_s(2) #=>"101"
(0b1010<<1).to_s(2) #=>"10100"

#2.9.3 指数表現
2e-3#=>0.002

#2.9.4 数値クラスのあれこれ
10.class #=>integer
1.5.class #=>Float

#Ruby2.3以前は整数クラスが2つあった
10.class #=>Fixnum
9999999999999999999.class #=>Bignum

#Ruby2.4以後はどちらもintegerクラスになった
10.class #=>integer
9999999999999999999.class #=>integer

#有理数リテラルを使う(3rが有理数リテラル)
r = 2/3r
r #=>(2/3)
r.class#=>Rational

#文字列から有理数に変換する
r = '2/3'.to_r
r #=>(2/3)
r.class#=>Rational

#複素数リテラルを使う(0.5iが複素数リテラル)
c = 0.3-0.5i
c #=>(0.3-0.5i)
c.class#=>Complex

#文字列から複素数に変換する
c = '0.3-0.5i'.to_c
c #=>(0.3-0.5i)
c.class#=>Complex

